Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
       - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:9874c7ddc4af37efefd989ed1ca254c59e41ad20456a6466bcdced858bc93db7" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:9874c7ddc4af37efefd989ed1ca254c59e41ad20456a6466bcdced858bc93db7" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "a143b6ab638b25bd9ef7ad15a26086ceaaba5052" -> "7ca05755a0827813de13004b3722f61ac50b7860"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4870702890444515009" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788902075918000" -> "1759226146143559000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1532167518347129923" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788902075962000" -> "1759226146412036800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1893914835767437068" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788901767139000" -> "1759226145842022800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initFlow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3347785299239566057" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788901814519000" -> "1759226145926251800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:9874c7ddc4af37efefd989ed1ca254c59e41ad20456a6466bcdced858bc93db7" -> (known after apply)
      ~ last_modified                  = "2025-09-25T08:31:20.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5182768503591962778" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788901857493000" -> "1759226146129158000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1020807260797197537" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788901826444000" -> "1759226145526296000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:12" -> (known after apply)
      ~ code_sha256                 = "3QW9wKqw3D2sims/LMbDscXn/3pzHeKhljT7J8wBqvQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-25T08:31:23.630+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:12" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/78501cc95f437686e1f4a3e3b738fbc8a122e96ed8efaff94b133ba1b177bc5d.zip" -> "builds/ff18385d7f6aabac9ffe9276412e1b3bb185413ebb8dafb3d5174f07aee25710.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172653 -> (known after apply)
      ~ version                     = "12" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/78501cc95f437686e1f4a3e3b738fbc8a122e96ed8efaff94b133ba1b177bc5d.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "a275838c98cf2de8bae73f6891259d8c" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/78501cc95f437686e1f4a3e3b738fbc8a122e96ed8efaff94b133ba1b177bc5d.zip" -> (known after apply)
      ~ key                           = "builds/78501cc95f437686e1f4a3e3b738fbc8a122e96ed8efaff94b133ba1b177bc5d.zip" -> "builds/ff18385d7f6aabac9ffe9276412e1b3bb185413ebb8dafb3d5174f07aee25710.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/78501cc95f437686e1f4a3e3b738fbc8a122e96ed8efaff94b133ba1b177bc5d.zip" -> "builds/ff18385d7f6aabac9ffe9276412e1b3bb185413ebb8dafb3d5174f07aee25710.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ff18385d7f6aabac9ffe9276412e1b3bb185413ebb8dafb3d5174f07aee25710.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ff18385d7f6aabac9ffe9276412e1b3bb185413ebb8dafb3d5174f07aee25710.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6748704657508888472" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/78501cc95f437686e1f4a3e3b738fbc8a122e96ed8efaff94b133ba1b177bc5d.zip" -> "builds/ff18385d7f6aabac9ffe9276412e1b3bb185413ebb8dafb3d5174f07aee25710.zip"
          ~ "timestamp" = "1758788904825639000" -> "1759226156552475000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17" -> (known after apply)
      ~ code_sha256                 = "8HaycR4C96C4530Q4EbT6YvNE0VKfcd0PBP7usPjh+M=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-25T08:31:19.901+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/07ae81b7c4e583b18236d23663e616891ac26cb0518d2bd534f017bdb86ca10a.zip" -> "builds/00f4df30c4e343712ed59bb54445e4e2c7e4f6f183b2848015ae52c1ba935941.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22795 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/07ae81b7c4e583b18236d23663e616891ac26cb0518d2bd534f017bdb86ca10a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "e20ee112a93344814e42c4c9ef4c4d16" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/07ae81b7c4e583b18236d23663e616891ac26cb0518d2bd534f017bdb86ca10a.zip" -> (known after apply)
      ~ key                           = "builds/07ae81b7c4e583b18236d23663e616891ac26cb0518d2bd534f017bdb86ca10a.zip" -> "builds/00f4df30c4e343712ed59bb54445e4e2c7e4f6f183b2848015ae52c1ba935941.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/07ae81b7c4e583b18236d23663e616891ac26cb0518d2bd534f017bdb86ca10a.zip" -> "builds/00f4df30c4e343712ed59bb54445e4e2c7e4f6f183b2848015ae52c1ba935941.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/00f4df30c4e343712ed59bb54445e4e2c7e4f6f183b2848015ae52c1ba935941.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/00f4df30c4e343712ed59bb54445e4e2c7e4f6f183b2848015ae52c1ba935941.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8853683872879562238" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/07ae81b7c4e583b18236d23663e616891ac26cb0518d2bd534f017bdb86ca10a.zip" -> "builds/00f4df30c4e343712ed59bb54445e4e2c7e4f6f183b2848015ae52c1ba935941.zip"
          ~ "timestamp" = "1758788901939379000" -> "1759226145526252000"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:9681170fa3f357c82cfa3e36eaf655eb1e2d0787d2db50b8cf169d40ce14e2fb496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:9681170fa3f357c82cfa3e36eaf655eb1e2d0787d2db50b8cf169d40ce14e2fb" -> (known after apply)
        name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:dac56bfa8010d5b60174938097b71e67650b72eccc99fc25b6e7ba5c519a6143" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "ca181f78edfdeec46ead94c01ab2c23264868896" -> "7dd14bde011f90d9c8abfb3fe6bc8274d4371157"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:dac56bfa8010d5b60174938097b71e67650b72eccc99fc25b6e7ba5c519a6143" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:dac56bfa8010d5b60174938097b71e67650b72eccc99fc25b6e7ba5c519a6143" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "ca181f78edfdeec46ead94c01ab2c23264868896" -> "7dd14bde011f90d9c8abfb3fe6bc8274d4371157"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/78c3095517ffcf734b446601e4755e6d8a31753c67f1885a416ae75598dd6418.zip" -> "builds/bcc96a4c1f1616e7a0e66518bf324005213fe8a15d18a532512b83823ddc94a5.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-25T08:31:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bcc96a4c1f1616e7a0e66518bf324005213fe8a15d18a532512b83823ddc94a5.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bcc96a4c1f1616e7a0e66518bf324005213fe8a15d18a532512b83823ddc94a5.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5099381353584653248" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/78c3095517ffcf734b446601e4755e6d8a31753c67f1885a416ae75598dd6418.zip" -> "builds/bcc96a4c1f1616e7a0e66518bf324005213fe8a15d18a532512b83823ddc94a5.zip"
          ~ "timestamp" = "1758788891647295000" -> "1759226142045156000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/53c56d532a88cf32c9a5aa107024a26abbe08ccd5ba6759b43fe952f25a4fcf8.zip" -> "builds/8a72a7329b110b2cd74e8770baf2c9bd735fe45a6645a5e66008153ac4ffe233.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-25T08:31:52.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8a72a7329b110b2cd74e8770baf2c9bd735fe45a6645a5e66008153ac4ffe233.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8a72a7329b110b2cd74e8770baf2c9bd735fe45a6645a5e66008153ac4ffe233.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "660272361625174732" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/53c56d532a88cf32c9a5aa107024a26abbe08ccd5ba6759b43fe952f25a4fcf8.zip" -> "builds/8a72a7329b110b2cd74e8770baf2c9bd735fe45a6645a5e66008153ac4ffe233.zip"
          ~ "timestamp" = "1758788889877703000" -> "1759226142611832000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8593219955145975113" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788890140163800" -> "1759226141251138000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7036279197010689732" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891849080000" -> "1759226142566227000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a2410dd2098bfb29e6c3cc6ac0e7666e01b73952d667fcb371bb63066e79bc3e.zip" -> "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-25T08:31:27.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2053505411063307639" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a2410dd2098bfb29e6c3cc6ac0e7666e01b73952d667fcb371bb63066e79bc3e.zip" -> "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip"
          ~ "timestamp" = "1758788889829377800" -> "1759226142417331000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5226775828998807460" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788889943635000" -> "1759226142027501200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4340200180676595597" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891458462000" -> "1759226142549995000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3879259677491543660" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891675633000" -> "1759226141327342000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c22e426f77284541c6c3a9c7a50deff254c8a892ec4bc2bbe59586e7beb40dc0.zip" -> "builds/5878fc3dbd42413da56520c37c3b96a7827dd69d8df05e33af9281d234716fd9.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-25T08:31:58.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5878fc3dbd42413da56520c37c3b96a7827dd69d8df05e33af9281d234716fd9.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5878fc3dbd42413da56520c37c3b96a7827dd69d8df05e33af9281d234716fd9.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "807132721663156487" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c22e426f77284541c6c3a9c7a50deff254c8a892ec4bc2bbe59586e7beb40dc0.zip" -> "builds/5878fc3dbd42413da56520c37c3b96a7827dd69d8df05e33af9281d234716fd9.zip"
          ~ "timestamp" = "1758788891816225000" -> "1759226141137518800"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4202137978304967626" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788889764461000" -> "1759226141615369000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1809525220908090289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788889741166200" -> "1759226142636103000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5716226381109412152" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788890147852000" -> "1759226141234843000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1910347681264577776" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788892042379000" -> "1759226142458791000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3794527833477597030" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891155541800" -> "1759226142412577000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5205775352625782300" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891511173000" -> "1759226142077036000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2763243847697898443" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891339550000" -> "1759226142143583000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4656483137912382624" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788889455068200" -> "1759226141912628800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1282555413372869923" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788889728876200" -> "1759226142429486000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2592705980886956501" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891513516000" -> "1759226141309948000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "356681974285082191" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788889926096000" -> "1759226142548853000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:dac56bfa8010d5b60174938097b71e67650b72eccc99fc25b6e7ba5c519a6143" -> (known after apply)
      ~ last_modified                  = "2025-09-25T08:31:26.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5458463784274948026" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758788891268037000" -> "1759226141941279800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14" -> (known after apply)
      ~ code_sha256                 = "TViWDqi8QFqcBPuWw9lFks1G4UaWcokghHqfIYkG2qE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-25T08:31:31.762+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:14" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/4ef2ea0bdbc3c479e9f9fc235de775cb3c124e706c71ade00bbe87746f3a1831.zip" -> "builds/e3a515809ed6bb59817f0dd544bcf0d98359e6b9cb6ca0d77a42430259c89427.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398838 -> (known after apply)
      ~ version                     = "14" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/4ef2ea0bdbc3c479e9f9fc235de775cb3c124e706c71ade00bbe87746f3a1831.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "36df847b1dfffd59c606b6360b190525-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250519061959773600000003/builds/4ef2ea0bdbc3c479e9f9fc235de775cb3c124e706c71ade00bbe87746f3a1831.zip" -> (known after apply)
      ~ key                           = "builds/4ef2ea0bdbc3c479e9f9fc235de775cb3c124e706c71ade00bbe87746f3a1831.zip" -> "builds/e3a515809ed6bb59817f0dd544bcf0d98359e6b9cb6ca0d77a42430259c89427.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/4ef2ea0bdbc3c479e9f9fc235de775cb3c124e706c71ade00bbe87746f3a1831.zip" -> "builds/e3a515809ed6bb59817f0dd544bcf0d98359e6b9cb6ca0d77a42430259c89427.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e3a515809ed6bb59817f0dd544bcf0d98359e6b9cb6ca0d77a42430259c89427.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e3a515809ed6bb59817f0dd544bcf0d98359e6b9cb6ca0d77a42430259c89427.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8771612553416739542" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4ef2ea0bdbc3c479e9f9fc235de775cb3c124e706c71ade00bbe87746f3a1831.zip" -> "builds/e3a515809ed6bb59817f0dd544bcf0d98359e6b9cb6ca0d77a42430259c89427.zip"
          ~ "timestamp" = "1758788903544683000" -> "1759226159500382000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15" -> (known after apply)
      ~ code_sha256                 = "9f/Tyklkl7XSnAyuAgZFjJktCVXzTtHrgNd8/Ebc7lU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-25T08:31:21.291+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:15" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/37f1cfb3c1de832c9e5be7f3e513954365dad5dca7d946380589dec3497b7fcf.zip" -> "builds/3bfd3d31be70675586cc59486f2c3f46277143880509ac880bbf7658550ccdff.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120524 -> (known after apply)
      ~ version                     = "15" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/37f1cfb3c1de832c9e5be7f3e513954365dad5dca7d946380589dec3497b7fcf.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "0b0be8d22082c1153c6dcbc958a8cbbe" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250519061959773600000003/builds/37f1cfb3c1de832c9e5be7f3e513954365dad5dca7d946380589dec3497b7fcf.zip" -> (known after apply)
      ~ key                           = "builds/37f1cfb3c1de832c9e5be7f3e513954365dad5dca7d946380589dec3497b7fcf.zip" -> "builds/3bfd3d31be70675586cc59486f2c3f46277143880509ac880bbf7658550ccdff.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/37f1cfb3c1de832c9e5be7f3e513954365dad5dca7d946380589dec3497b7fcf.zip" -> "builds/3bfd3d31be70675586cc59486f2c3f46277143880509ac880bbf7658550ccdff.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.